In [1]:
#Creating Databases in MySQL
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="krish",
  password="#meKRISH30"
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7f1e565f6390>

In [2]:
#cursor for running the MySQL in Python Jupyter Notebook

cursor = mydb.cursor()

In [3]:

cursor.execute('SHOW DATABASES')

for database in cursor:
    print(database)

('information_schema',)
('krish',)
('mysql',)
('performance_schema',)
('sys',)

In [4]:
# Create a new Database

#cursor.execute('CREATE DATABASE krish')

In [5]:
# -selected database

cursor.execute('use krish')

In [6]:
# Create a new table 

#sql= 'create table BT_Dept (id varchar(5) primary key, name varchar(25), age int(3), sex varchar(1))'
#cursor.execute(sql)

In [7]:
#Show tables

sql= "show tables"
cursor.execute(sql)

for database in cursor:
    print(database)

('BT_Dept',)

# ALTER TABLE

* The ALTER TABLE statement is used to add, delete, or modify columns in an existing table.
* The ALTER TABLE statement is also used to add and drop various constraints on an existing table.

In [8]:
# ALTER TABLE
# Modify a column attribute- (id varchar(5) --> id varchar(6))
"""
sql = 'ALTER TABLE BT_Dept MODIFY id varchar(6)'
cursor.execute(sql)
print(cursor) """

"\nsql = 'ALTER TABLE BT_Dept MODIFY id varchar(6)'\ncursor.execute(sql)\nprint(cursor) "

In [9]:
# Add a column attribute
"""
sql = 'ALTER TABLE BT_Dept ADD email varchar(20)'
cursor.execute(sql)

print(cursor) """

"\nsql = 'ALTER TABLE BT_Dept ADD email varchar(20)'\ncursor.execute(sql)\n\nprint(cursor) "

In [10]:
# Describe a Table
"""
sql = ("DESCRIBE BT_Dept ")
cursor.execute(sql)
"""
#How to print desc table

'\nsql = ("DESCRIBE BT_Dept ")\ncursor.execute(sql)\n'

# INSERT INTO
* The INSERT INTO statement is used to insert new records in a table.
* It is possible to write the INSERT INTO statement in two ways.

#### INSERT INTO Syntax
1. INSERT INTO table_name (column1, column2, column3, ...) VALUES (value1, value2, value3, ...);
2. INSERT INTO table_name VALUES (value1, value2, value3, ...);
 
NOTE-If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. The INSERT INTO syntax would be as follows:

In [11]:
#Insert a values in Tables
"""
sql = 'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)'
val = ('14BT04','Asifa Nasir', '25','F', 'asifa@gmail.com')
cursor.execute(sql,val)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

'\nsql = \'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)\'\nval = (\'14BT04\',\'Asifa Nasir\', \'25\',\'F\', \'asifa@gmail.com\')\ncursor.execute(sql,val)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

In [12]:
#Insert Multiple values in Tables
""""
sql = 'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)'
val = [
    ('14BT05','Asish Mondal', '26','M', 'asish@gmail.com'),
    ('14BT06','Krish Bhowmick', '26','M', 'krish@gmail.com'),
    ('14BT07','Lopa Mudra', '25','F', 'Lopa@gmail.com'),
    ('14BT08','Mallika Ghosh', '25','F', 'mallika@gmail.com'),
    ('14BT09','Moumita Giri', '25','F', 'moumi@gmail.com')
]
cursor.executemany(sql,val)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

'"\nsql = \'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)\'\nval = [\n    (\'14BT05\',\'Asish Mondal\', \'26\',\'M\', \'asish@gmail.com\'),\n    (\'14BT06\',\'Krish Bhowmick\', \'26\',\'M\', \'krish@gmail.com\'),\n    (\'14BT07\',\'Lopa Mudra\', \'25\',\'F\', \'Lopa@gmail.com\'),\n    (\'14BT08\',\'Mallika Ghosh\', \'25\',\'F\', \'mallika@gmail.com\'),\n    (\'14BT09\',\'Moumita Giri\', \'25\',\'F\', \'moumi@gmail.com\')\n]\ncursor.executemany(sql,val)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

In [13]:
# It doesnot make sense
"""
sql = 'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)'
val = ('14BT10','Mrityunjoy Sarker', '26','M', 'mrity@gmail.com')
cursor.execute(sql,val)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print("Last record inserted.", cursor.lastrowid)"""

'\nsql = \'INSERT INTO BT_Dept(id,name,age,sex,email) values(%s, %s, %s, %s, %s)\'\nval = (\'14BT10\',\'Mrityunjoy Sarker\', \'26\',\'M\', \'mrity@gmail.com\')\ncursor.execute(sql,val)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint("Last record inserted.", cursor.lastrowid)'

# SELECT
The SELECT statement is used to select data from a database.
The data returned is stored in a result table, called the result-set.

#### SELECT Syntax
1. SELECT column1, column2, ... FROM table_name;

2. SELECT * FROM table_name;

In [14]:
#SELECT

sql= "SELECT * FROM BT_Dept"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', 24, 'F', 'afreen@gmail.com')
('14BT02', 'Arnab Baneerjee', 25, 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', 25, 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', 25, 'F', 'asifa@gmail.com')
('14BT05', 'Asish Mondal', 26, 'M', 'asish@gmail.com')
('14BT06', 'Krish Bhowmick', 26, 'M', 'krish@gmail.com')
('14BT08', 'Mallika Ghosh', 25, 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', 25, 'F', 'moumi@gmail.com')
('14BT10', 'Mrityunjoy Sarker', 26, 'M', 'mrity@gmail.com')

# SELECT DISTINCT

The SELECT DISTINCT statement is used to return only distinct (different) values.
Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.
#### SELECT DISTINCT Syntax
* SELECT DISTINCT column1, column2, ... 
* FROM table_name;

In [15]:
# DISTINCT means Different --> No duplicate value

sql= "SELECT DISTINCT age FROM BT_Dept "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(24,)
(25,)
(26,)

# WHERE 
* The WHERE clause is used to filter records.
* The WHERE clause is used to extract only those records that fulfill a specified condition.
#### WHERE Syntax
* SELECT column1, column2, ...
* FROM table_name
* WHERE condition;

In [16]:
# WHERE

sql= "SELECT * FROM BT_Dept WHERE age = '25' "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT02', 'Arnab Baneerjee', 25, 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', 25, 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', 25, 'F', 'asifa@gmail.com')
('14BT08', 'Mallika Ghosh', 25, 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', 25, 'F', 'moumi@gmail.com')

# AND 
The WHERE clause can be combined with AND, OR, and NOT operators.
* The AND and OR operators are used to filter records based on more than one condition:
* The AND operator displays a record if all the conditions separated by AND are TRUE.
#### AND Syntax
* SELECT column1, column2, ...
* FROM table_name
* WHERE condition1 AND condition2 AND condition3 ...;

In [17]:
#AND

sql= "SELECT * FROM BT_Dept WHERE age = '25' AND age = '26' "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

#There no one's age is  25 and 26 -->So, It does not print anything

# OR
* The WHERE clause can be combined with AND, OR, and NOT operators.
* The AND and OR operators are used to filter records based on more than one condition:
* The OR operator displays a record if any of the conditions separated by OR is TRUE.
#### OR Syntax
* SELECT column1, column2, ...
* FROM table_name
* WHERE condition1 OR condition2 OR condition3 ...;

In [18]:
# OR

sql= "SELECT * FROM BT_Dept WHERE age = '24' OR age = '26' "
cursor.execute(sql)
myresult= cursor.fetchall()  #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', 24, 'F', 'afreen@gmail.com')
('14BT05', 'Asish Mondal', 26, 'M', 'asish@gmail.com')
('14BT06', 'Krish Bhowmick', 26, 'M', 'krish@gmail.com')
('14BT10', 'Mrityunjoy Sarker', 26, 'M', 'mrity@gmail.com')

# NOT
* The WHERE clause can be combined with AND, OR, and NOT operators.
* The NOT operator displays a record if the condition(s) is NOT TRUE.
#### NOT Syntax
* SELECT column1, column2, ...
* FROM table_name
* WHERE NOT condition;

In [19]:
# NOT

sql= "SELECT * FROM BT_Dept WHERE NOT age = '25' and age = '26' "  # use OR & AND see the ans, but why??? 
cursor.execute(sql)
myresult= cursor.fetchall()#fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT05', 'Asish Mondal', 26, 'M', 'asish@gmail.com')
('14BT06', 'Krish Bhowmick', 26, 'M', 'krish@gmail.com')
('14BT10', 'Mrityunjoy Sarker', 26, 'M', 'mrity@gmail.com')

# ORDER BY
* The ORDER BY keyword is used to sort the result-set in ascending or descending order.
* The ORDER BY keyword sorts the records in ascending order by default. To sort the records in descending order, use the DESC keyword.
#### ORDER BY Syntax
* SELECT column1, column2, ...
* FROM table_name
* ORDER BY column1, column2, ... ASC|DESC;

In [20]:
# ORDER BY

sql= "SELECT * FROM BT_Dept ORDER BY age "   
cursor.execute(sql)
myresult= cursor.fetchall()     #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', 24, 'F', 'afreen@gmail.com')
('14BT02', 'Arnab Baneerjee', 25, 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', 25, 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', 25, 'F', 'asifa@gmail.com')
('14BT08', 'Mallika Ghosh', 25, 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', 25, 'F', 'moumi@gmail.com')
('14BT05', 'Asish Mondal', 26, 'M', 'asish@gmail.com')
('14BT06', 'Krish Bhowmick', 26, 'M', 'krish@gmail.com')
('14BT10', 'Mrityunjoy Sarker', 26, 'M', 'mrity@gmail.com')

# NULL Value

* A field with a NULL value is a field with no value.
* If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value.
### How to Test for NULL Values?
* It is not possible to test for NULL values with comparison operators, such as =, <, or <>.
* We will have to use the IS NULL and IS NOT NULL operators instead.
#### IS NULL 
*  SELECT column_names 
* FROM table_name 
* WHERE column_name IS NULL;
#### IS NOT NULL
* SELECT column_names 
* FROM table_name 
* WHERE column_name IS NOT NULL;

Note: A NULL value is different from a zero value or a field that contains spaces. A field with a NULL value is one that has been left blank during record creation!

In [21]:
# NULL VALUE

sql= "SELECT age FROM BT_Dept WHERE age IS NULL "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

# It doesnot show any output because There is no null value in Dataset

In [22]:
# NOT NULL

sql= "SELECT age FROM BT_Dept WHERE age IS NOT NULL "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(24,)
(25,)
(25,)
(25,)
(26,)
(26,)
(25,)
(25,)
(26,)

# UPDATE
* The UPDATE statement is used to modify the existing records in a table.
#### UPDATE Syntax
* UPDATE table_name SET column1 = value1, column2 = value2, ... 
* WHERE condition;

Note: Be careful when updating records in a table! Notice the WHERE clause in the UPDATE statement. The WHERE clause specifies which record(s) that should be updated. If you omit the WHERE clause, all records in the table will be updated!

In [23]:
# UPDATE
"""
sql= "UPDATE BT_Dept SET name= 'Aafreen Ansari' WHERE id='14BT01' "  
cursor.execute(sql)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

'\nsql= "UPDATE BT_Dept SET name= \'Aafreen Ansari\' WHERE id=\'14BT01\' "  \ncursor.execute(sql)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

# DELETE
* The DELETE statement is used to delete existing records in a table.
#### DELETE Syntax
* DELETE FROM table_name WHERE condition;

Note: Be careful when deleting records in a table! Notice the WHERE clause in the DELETE statement. The WHERE clause specifies which record(s) should be deleted. If you omit the WHERE clause, all records in the table will be deleted!

In [24]:
# DELETE
"""
sql= "DELETE FROM BT_Dept WHERE name= 'Lopa Mudra' "  
cursor.execute(sql)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

#It will delete the whole row of data

'\nsql= "DELETE FROM BT_Dept WHERE name= \'Lopa Mudra\' "  \ncursor.execute(sql)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

# BETWEEN 
* The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates.
* The BETWEEN operator is inclusive: begin and end values are included. 
#### BETWEEN Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE column_name BETWEEN value1 AND value2;

# LIMIT(MySQL) / TOP(SQL Server,MS)
* The SELECT TOP clause is used to specify the number of records to return.
* The SELECT TOP clause is useful on large tables with thousands of records. Returning a large number of records can impact performance.
#### LIMIT Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE condition
* LIMIT number;

In [25]:
# BETWEEN & LIMIT

sql= "SELECT * FROM BT_Dept WHERE age BETWEEN 20 and 24 LIMIT 3 "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', 24, 'F', 'afreen@gmail.com')

# MIN() and MAX() Functions
* The MIN() function returns the smallest value of the selected column.
* The MAX() function returns the largest value of the selected column.
#### MIN() Syntax
* SELECT MIN(column_name)
* FROM table_name
* WHERE condition;
#### MAX() Syntax
* SELECT MAX(column_name)
* FROM table_name
*WHERE condition;

In [26]:
# MINIMUM

sql= "SELECT MIN(age) FROM BT_Dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(24,)

In [27]:
# MAXIMUM

sql= "SELECT MAX(age) FROM BT_Dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(25,)

# COUNT(), AVG() and SUM() Functions
* The COUNT() function returns the number of rows that matches a specified criterion.
* The AVG() function returns the average value of a numeric column.
* The SUM() function returns the total sum of a numeric column.
#### COUNT() Syntax
* SELECT COUNT(column_name)
* FROM table_name
* WHERE condition;
#### AVG() Syntax
* SELECT AVG(column_name)
* FROM table_name
* WHERE condition;
#### SUM() Syntax
* SELECT SUM(column_name)
* FROM table_name
* WHERE condition;

In [28]:
# COUNT

sql= "SELECT COUNT(sex) FROM BT_Dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(5,)

In [29]:
# AVERAGE

sql= "SELECT AVG(age) FROM BT_Dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(Decimal('24.8000'),)

In [30]:
# SUM

sql= "SELECT SUM(age) FROM BT_Dept WHERE sex ='F' "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(Decimal('124'),)

# SQL LIKE Operator
The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.
There are two wildcards often used in conjunction with the LIKE operator:

* % - The percent sign represents zero, one, or multiple characters
* _ - The underscore represents a single character

In [31]:
# LIKE

sql= "SELECT * FROM BT_Dept WHERE name LIKE 'a%'  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', 24, 'F', 'afreen@gmail.com')
('14BT02', 'Arnab Baneerjee', 25, 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', 25, 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', 25, 'F', 'asifa@gmail.com')
('14BT05', 'Asish Mondal', 26, 'M', 'asish@gmail.com')

In [32]:
# LIKE

sql= "SELECT * FROM BT_Dept WHERE name LIKE '_a%'  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', 24, 'F', 'afreen@gmail.com')
('14BT08', 'Mallika Ghosh', 25, 'F', 'mallika@gmail.com')

# IN Operator
* The IN operator allows you to specify multiple values in a WHERE clause.
* The IN operator is a shorthand for multiple OR conditions.
#### IN Syntax
* SELECT column_name(s) 
* FROM table_name 
* WHERE column_name IN (value1, value2, ...);
* ## or
* SELECT column_name(s) 
* FROM table_name 
* WHERE column_name IN (SELECT STATEMENT);

In [33]:
# IN
#Student's whose age are 24&26

sql= "SELECT * FROM BT_Dept WHERE age IN (24,26)  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT01', 'Aafreen Ansari', 24, 'F', 'afreen@gmail.com')
('14BT05', 'Asish Mondal', 26, 'M', 'asish@gmail.com')
('14BT06', 'Krish Bhowmick', 26, 'M', 'krish@gmail.com')
('14BT10', 'Mrityunjoy Sarker', 26, 'M', 'mrity@gmail.com')

In [34]:
# NOT IN
#Student's whose age are not 24&26

sql= "SELECT * FROM BT_Dept WHERE age NOT IN (24,26)  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('14BT02', 'Arnab Baneerjee', 25, 'M', 'arnaba@gmail.com')
('14BT03', 'Arushi Sinha', 25, 'F', 'arushi@gmail.com')
('14BT04', 'Asifa Nasir', 25, 'F', 'asifa@gmail.com')
('14BT08', 'Mallika Ghosh', 25, 'F', 'mallika@gmail.com')
('14BT09', 'Moumita Giri', 25, 'F', 'moumi@gmail.com')

# Aliases- (temporary, a false or assumed identity.)
* SQL aliases are used to give a table, or a column in a table, a temporary name.
* Aliases are often used to make column names more readable.
* An alias only exists for the duration of the query.
#### Alias Column Syntax
* SELECT column_name AS alias_name
* FROM table_name;
#### Alias Table Syntax
* SELECT column_name(s)
* FROM table_name AS alias_name;

In [35]:
#ALIASES
#

sql= "SELECT id AS RollNo, name AS Name FROM BT_Dept WHERE age NOT IN (24,26)  "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

#NOTE--> I was expecting a heading, but it's not comming.

('14BT02', 'Arnab Baneerjee')
('14BT03', 'Arushi Sinha')
('14BT04', 'Asifa Nasir')
('14BT08', 'Mallika Ghosh')
('14BT09', 'Moumita Giri')

# GROUP BY
* The GROUP BY statement groups rows that have the same values into summary rows, like "find the number of customers in each country".
* The GROUP BY statement is often used with aggregate functions (COUNT, MAX, MIN, SUM, AVG) to group the result-set by one or more columns.
#### GROUP BY Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE condition
* GROUP BY column_name(s)
* ORDER BY column_name(s);

In [36]:
# GROUP BY
#How many male and female in your class?

sql= "SELECT COUNT(name), sex FROM BT_Dept GROUP BY sex   "  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(5, 'F')
(4, 'M')

# HAVING
* The HAVING clause was added to SQL because the WHERE keyword could not be used with aggregate functions.
#### HAVING Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE condition
* GROUP BY column_name(s)
* HAVING condition
* ORDER BY column_name(s);

In [40]:
# HAVING
#

sql= "SELECT COUNT(age), sex FROM BT_Dept GROUP BY sex HAVING COUNT(age) >= 5"  
cursor.execute(sql)
myresult= cursor.fetchall()    #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(5, 'F')

## SQL EXISTS Operator

* The EXISTS operator is used to test for the existence of any record in a subquery.
* The EXISTS operator returns true if the subquery returns one or more records.
#### EXISTS Syntax
* SELECT column_name(s)
* FROM table_name
* WHERE EXISTS (SELECT column_name FROM table_name WHERE condition);